import { Injectable } from '@angular/core';
import { Observable, of } from 'rxjs';
import {Articles} from '../_models/article.model'

@Injectable({
  providedIn: 'root'
})
export class ArticlesService {

  private _articles: Array<Articles> = new Array<Articles>(
    { id: 1, name: 'החליפות המושלמות לגבר',description:'מבצעים עד סוף מרץ על כל החליפות לגבר', category: 'מבצעים',createdAt:new Date(),
    content:`
    <p>92.8% מבני 60 ומעלה מהמגזר הכללי קיבלו לפחות את מנת החיסון הראשונה או חלו בקורונה והחלימו. כך עולה מנתוני משרד הבריאות. השיעור בחברה החרדית ובחברה הערבית בגילים אלה נמוך בהרבה. בסך הכול, 88% מבני ה-60 ומעלה בישראל, כולל חרדים וערבים, קיבלו לפחות מנת חיסון אחת או שחלו בקורונה והחלימו ולכן הם לא אמורים להתחסן בשלב זה.</p> 
                <p>
                    נכון לשעות הצהריים (יום א') 3,426,810 ישראלים קיבלו את מנת החיסון הראשונה ו-2,016,351 גם את השנייה. כלומר 37.19% מהישראלים קיבלו מנת חיסון אחת לפחות ו-21.88% שתי מנות. שיעור המתחסנים הגבוה ביותר הוא בקבוצת הגיל 70 עד 79.
                </p>
                <p>מנתוני משרד הבריאות עולה כי בסך כל המגזרים בארץ – 3.4% מבני 60 ומעלה חלו בקורונה והחלימו. 69% קיבלו את מנת החיסון השנייה לפני יותר משבוע – ולכן הם נחשבים מחוסנים. 10% קיבלו את מנת החיסון הראשונה לפני יותר משבועיים או שלא עבר שבוע מאז קיבלו את המנה השנייה. 5.4% קיבלו את המנה הראשונה בשבועיים האחרונים וכ-12% לא באו להתחסן עדיין.                 </p>
                <p>כאמור, במגזר הכללי שיעור המתחסנים בקרב בני 60 ומעלה הוא הגבוה ביותר. 75% כבר נחשבים מחוסנים, לאחר שעבר שבוע ויותר מאז שקיבלו את מנת החיסון השנייה, 10% מתקרבים להגדרת המחוסנים, 5.2% קיבלו את מנת החיסון הראשונה בשבועיים האחרונים ו-2.5% בקרב גילים אלה במגזר הכללי – חלו בקורונה והחלימו. כך שלמעשה בקבוצת גיל זו במגזר הכללי 7.2% טרם התחסנו.                </p>`
    ,picUrl:'/assets/slider/slide-img1.jpg',user:{username:'Amit Gal',profilePic:''} },
    { id: 2, name: 'עוד שניה כבר קיץ',description:'אבל למי זה משנה עדיין יש קורונה', category: 'המלצות',createdAt:new Date(),
    content:`
    <p>92.8% מבני 60 ומעלה מהמגזר הכללי קיבלו לפחות את מנת החיסון הראשונה או חלו בקורונה והחלימו. כך עולה מנתוני משרד הבריאות. השיעור בחברה החרדית ובחברה הערבית בגילים אלה נמוך בהרבה. בסך הכול, 88% מבני ה-60 ומעלה בישראל, כולל חרדים וערבים, קיבלו לפחות מנת חיסון אחת או שחלו בקורונה והחלימו ולכן הם לא אמורים להתחסן בשלב זה.</p> 
                <p>
                    נכון לשעות הצהריים (יום א') 3,426,810 ישראלים קיבלו את מנת החיסון הראשונה ו-2,016,351 גם את השנייה. כלומר 37.19% מהישראלים קיבלו מנת חיסון אחת לפחות ו-21.88% שתי מנות. שיעור המתחסנים הגבוה ביותר הוא בקבוצת הגיל 70 עד 79.
                </p>
                <p>מנתוני משרד הבריאות עולה כי בסך כל המגזרים בארץ – 3.4% מבני 60 ומעלה חלו בקורונה והחלימו. 69% קיבלו את מנת החיסון השנייה לפני יותר משבוע – ולכן הם נחשבים מחוסנים. 10% קיבלו את מנת החיסון הראשונה לפני יותר משבועיים או שלא עבר שבוע מאז קיבלו את המנה השנייה. 5.4% קיבלו את המנה הראשונה בשבועיים האחרונים וכ-12% לא באו להתחסן עדיין.                 </p>
                <p>כאמור, במגזר הכללי שיעור המתחסנים בקרב בני 60 ומעלה הוא הגבוה ביותר. 75% כבר נחשבים מחוסנים, לאחר שעבר שבוע ויותר מאז שקיבלו את מנת החיסון השנייה, 10% מתקרבים להגדרת המחוסנים, 5.2% קיבלו את מנת החיסון הראשונה בשבועיים האחרונים ו-2.5% בקרב גילים אלה במגזר הכללי – חלו בקורונה והחלימו. כך שלמעשה בקבוצת גיל זו במגזר הכללי 7.2% טרם התחסנו.                </p>`
    ,picUrl:'/assets/slider/slide-img2.jpg',user:{username:'Amit Gal',profilePic:''} },
    { id: 3, name: 'כוכבה הכוכבית מדברת לראשונה',description:'אחרי שפרשה מחיי הדוגמנות כוכבה מפתיעה במקצוע חדש', category: 'ראיונות',createdAt:new Date()
    ,content:`
    <p>92.8% מבני 60 ומעלה מהמגזר הכללי קיבלו לפחות את מנת החיסון הראשונה או חלו בקורונה והחלימו. כך עולה מנתוני משרד הבריאות. השיעור בחברה החרדית ובחברה הערבית בגילים אלה נמוך בהרבה. בסך הכול, 88% מבני ה-60 ומעלה בישראל, כולל חרדים וערבים, קיבלו לפחות מנת חיסון אחת או שחלו בקורונה והחלימו ולכן הם לא אמורים להתחסן בשלב זה.</p> 
                <p>
                    נכון לשעות הצהריים (יום א') 3,426,810 ישראלים קיבלו את מנת החיסון הראשונה ו-2,016,351 גם את השנייה. כלומר 37.19% מהישראלים קיבלו מנת חיסון אחת לפחות ו-21.88% שתי מנות. שיעור המתחסנים הגבוה ביותר הוא בקבוצת הגיל 70 עד 79.
                </p>
                <p>מנתוני משרד הבריאות עולה כי בסך כל המגזרים בארץ – 3.4% מבני 60 ומעלה חלו בקורונה והחלימו. 69% קיבלו את מנת החיסון השנייה לפני יותר משבוע – ולכן הם נחשבים מחוסנים. 10% קיבלו את מנת החיסון הראשונה לפני יותר משבועיים או שלא עבר שבוע מאז קיבלו את המנה השנייה. 5.4% קיבלו את המנה הראשונה בשבועיים האחרונים וכ-12% לא באו להתחסן עדיין.                 </p>
                <p>כאמור, במגזר הכללי שיעור המתחסנים בקרב בני 60 ומעלה הוא הגבוה ביותר. 75% כבר נחשבים מחוסנים, לאחר שעבר שבוע ויותר מאז שקיבלו את מנת החיסון השנייה, 10% מתקרבים להגדרת המחוסנים, 5.2% קיבלו את מנת החיסון הראשונה בשבועיים האחרונים ו-2.5% בקרב גילים אלה במגזר הכללי – חלו בקורונה והחלימו. כך שלמעשה בקבוצת גיל זו במגזר הכללי 7.2% טרם התחסנו.                </p>`
    
    ,picUrl:'https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/a737788e-2be1-4a35-abb7-7d06d4080a62/dbwl6kl-74aa142f-cf69-4606-8766-e07c6f178283.jpg/v1/fill/w_1024,h_683,q_75,strp/elsa_by_kayleighjune_dbwl6kl-fullview.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOiIsImlzcyI6InVybjphcHA6Iiwib2JqIjpbW3siaGVpZ2h0IjoiPD02ODMiLCJwYXRoIjoiXC9mXC9hNzM3Nzg4ZS0yYmUxLTRhMzUtYWJiNy03ZDA2ZDQwODBhNjJcL2Rid2w2a2wtNzRhYTE0MmYtY2Y2OS00NjA2LTg3NjYtZTA3YzZmMTc4MjgzLmpwZyIsIndpZHRoIjoiPD0xMDI0In1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmltYWdlLm9wZXJhdGlvbnMiXX0.Ym7zgi9zqZzKD8mVRpdqbdiO1EkayF9fejEHIr0TgJI',user:{username:'Amit Gal',profilePic:''} },
    { id: 4, name: '"הייתי בחורה מאוד ביישנית וסגורה. היום הבנתי שהחשיפה הזאת נכונה לי"',description:`ספיר נרקיס הבינה שהיא הגיעה לבשלות. מילדה ביישנית באשדוד, שמסרבת להיות בפרונט על אף העיסוק של בעלה, כעת היא דוחפת קדימה. מותג הפיג'מות בעיצובה שהגיע בול בזמן הקורונה, היחסים עם ליאור שהפכו טובים מאי פעם, ניתוחים פלסטיים ואפילו טיפולי טיפוח זוגיים. ריאיון `, category: 'ראיונות',createdAt:new Date(),
    content:`
    <p>לפני שנה וחודשיים, כשהעולם עדיין היה קיים, ספיר נרקיס (31) השתתפה, לצד בעלה ליאור, בקליפ לגרסת הכיסוי שהוא הקליט לשירה של להקת כנסיית השכל "היינו עושים אהבה". "היה לנו טוב, היה לנו רע, היינו ביחד, לא השארנו ברירה", שר שם ליאור, היישר מהלב, כשברקע פריימים מושקעים בכיכובה של אשתו מזה 11 שנים. צילומי הקליפ נערכו בעיצומו של המשבר הקשה ביותר בזוגיות שלהם עד כה - משבר שעורר הדים רבים בתקשורת והציף שמועות עסיסיות בנוגע למה שגרם לו, אותן הפריכו בני הזוג, חזור והפרך.
<p/>
<p>
ובכל זאת, המצב במשפחת נרקיס, הכוללת גם שלושה ילדים, היה רחוק מלהיות מהפכה של שמחה. ספיר (במקור, ואנונו), הצעירה מליאור ב-13 שנה, התעוררה בוקר אחר, החליטה שמעתה והלאה היא מפסיקה לוותר על החלומות שלה לטובת אלה של ליאור, והתוצאה הייתה רעידת אדמה בדרגה 8.5 בסולם ריכטר במערכת היחסים בין השניים.
<p/>
<p>
"צילמנו את הקליפ הזה כשהיינו ממש בלב הסערה", מספרת ספיר, "הוא מלא באמוציות אמיתיות לגמרי. האמת היא שבבוקר של היום שבו זה צולם דווקא הצלחנו להגיע להבנות והיה פיוס בינינו, אבל השיר הזה כנראה הקפיץ אצלי את הכול מחדש. תוך כדי הצילומים שלו שוב נוצר זעזוע וכשהקליפ יצא הייתי נסערת לגמרי. נורא כעסתי. לא רציתי שזה ייצא. ברגע האחרון אפילו ניסיתי לעצור את היציאה שלו אבל הוא כבר היה באוויר".
<p/>
`
    ,picUrl:'https://img.wcdn.co.il/f_auto,w_1400,t_100/3/1/3/0/3130126-46.png',user:{username:'Amit Gal',profilePic:''} },

    );


    public getSingleArticle(articleid:number):Observable<Articles>{
      return of(this._articles.find(value=>value.id==articleid))
    }

    public getAllArticles():Observable<Articles[]>{
      return of(this._articles)
    }
  

  constructor() { }
}
